<template>
    <div class="container">
        <h1 class="text-primary mt-5">バージョン3.0の開発予告とお詫び</h1>
        <p>
            National Economy Onlineをご利用いただきありがとうございます。開発者のArthurよりお知らせがあります。
        </p>
        <p>
            National Economy Onlineは、コロナ禍が本格的に社会問題化した2020年4月にリリースし、これまで多くのユーザに遊んでいただいております。
            その中で、私が想定していなかった使い方がなされています。
        </p>
        <p>
            具体的には、知らないプレイヤーをゲームに招待する事例が発生しています。
            これは、ゲームidが連番発行であること、全てのユーザが観戦できることによって起こっています。
        </p>
        <p>
            現在の仕様では、ゲームを作成した時点でゲームが開始するので、参加を拒否することはできません。
            また、ゲームを削除できるのはゲーム作成者のみとなっています。
            ユーザの名前も自由に決められるため、(現状では確認しておりませんが)嫌がらせが可能な仕様となってしまっています。
        </p>
        <p>
            これにより、不快な思いをなさっているユーザがいらっしゃいましたら、大変申し訳ございません。
            (ただ、こうした行為について非難する意図は一切ありません。仕様上容易に起こりうることなので、開発者の私に責任があると考えております。)
        </p>
        <p>
            これらの問題を解決するために、以下のような機能を実装したバージョン3.0を開発します。
        </p>
        <ul>
            <li>ゲーム参加の同意ウィンドウの追加(全員が同意してからゲーム開始)</li>
            <li>友達機能</li>
            <li>参加者募集機能(一般に他のプレイヤーと自由に対戦できるモード)</li>
            <li>ゲームIDを複雑な文字列に変更</li>
        </ul>
        <p>
            ※これは構想段階で、機能が変わる可能性もあります。
        </p>
        <p>
            バージョン3.0リリースまでの暫定対応として、利用者の皆さまにお願いがあります。
            あらかじめ他のコミュニケーションツールで連絡を取るなどして、<span class="text-red">全メンバーが参加に合意した上でゲームに招待してください</span>。
            もし、お困りのことがあれば遠慮なく、<a href="https://twitter.com/Arthur1__" target="_blank" rel="noopener">@Arthur1__</a>までご連絡ください。
            (DMを開放しております。)
        </p>
        <p>
            なお、大変恐縮なのですが、私が就職活動や研究などで多忙なため、リリース予定日をお知らせすることは現状できません。より多くの方に楽しんで使っていただけるよう、できる限り早くリリースできたら良いなと思っております。
        </p>
        <p>
            引き続き、National Economy Onlineをよろしくお願いいたします。
        </p>
        <p>
            2021年1月18日 Arthur
        </p>
    </div>
</template>
