<template>
    <div class="container">
        <h1 class="text-primary mt-5">ヘルプ</h1>
        <h2 class="text-secondary mt-4">このサイトについて</h2>
        <p>
            ナショナルエコノミーをオンラインで遊ぶことができるWebアプリです。ソリティアには対応していません。
        </p>
        <h2 class="text-secondary mt-4">ゲームの作成</h2>
        <div class="row">
            <div class="col-sm-6">
                <img src="/img/help1.png" class="img-fluid" alt="" />
            </div>
            <div class="col-sm-6">
                <p>
                    「ホーム」ページの「ゲーム作成」ボタンをクリックすると作成フォームが表示されます。ゲームタイプ「ミックス」では、全シリーズの全てのカードが使用されます。ユーザ名欄に同じ人を追加することはできません。
                </p>
            </div>
        </div>
        <h2 class="text-secondary mt-4">ゲーム画面</h2>
        <div class="row">
            <div class="col-sm-6">
                <img src="/img/help2.png" class="img-fluid" alt="" />
            </div>
            <div class="col-sm-6">
                <p>
                    「ホーム」の「プレイ中のゲーム」リストから選択するとゲーム画面が表示されます。自分のプレイヤー情報が上部に表示され、その下にゲーム全体の情報と公共職場、さらに下には自分の次から手番順に他のプレイヤーの情報が表示されます。
                </p>
                <p>
                    手番プレイヤーは、建物カードをクリックして職場を使用できます。
                </p>
                <p>
                    行動によっては、どのカードを捨てるか、どのカードを建設するか、などの選択が必要な場合があります。その場合には、使用した後に専用のウィンドウが表示されます。選択は下部のチェックボックスを使用するか、カードをクリックしてください。建設では、カードを左クリックで建設する建物、右クリックでコストとして選択できます。
                </p>
                <p>
                    ラウンド終了時の手札の廃棄や建物の売却も同様に、下部に表示されるウィンドウから行います。売却時に手札を見たい場合には、ウィンドウ左上の「切り替え」ボタンを押してください。
                </p>
            </div>
        </div>
        <p class="text-danger">
            ロード中のまま固まってしまう、自動でリロードされない、通知が重複する、などの不具合が生じた場合には、ページをF5でリロードしてください。それでも直らない場合には下記連絡先までお願いします。
        </p>
        <h2 class="text-secondary mt-4">観戦機能</h2>
        <p>
            ゲーム画面のURLを共有すると観戦ができます。ただし、観戦者もログインしている必要があります。
        </p>
        <h2 class="text-secondary mt-4">お問い合わせ</h2>
        <p>
            このサイトに関するお問い合わせ、障害・バグレポートは、<a href="https://twitter.com/Arthur1__" target="_blank" rel="noopener">@Arthur1__</a>までお寄せください。
        </p>
    </div>
</template>
